app/controllers/employees_controller.rb

  def create
    @employee = Employee.new employee_params
    if @employee.save
---
INSERT INTO "employees" ("name", "lastname", "address", "phone", "salary", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def index
    @allEmployees = Employee.all
---
SELECT "employees".* FROM "employees"

  def update
    @employee.update employee_params
---
UPDATE "employees" SET "name" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["name", "Employee112"], ["updated_at", "2021-10-05 17:03:30.562835"], ["id", 1]]

  def set_employee
    @employee = Employee.find params[:id]
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]